digidoc4j/src/test/resources/testFiles/special-char-files/pdf-containing-xml.pdf

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:d="http://www.sk.ee/DigiDocService/DigiDocService_2_3.wsdl"
	xmlns:mss="http://www.sk.ee:8096/MSSP_GW/MSSP_GW.wsdl">
	<SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
		<d:MobileCreateSignature>
			<IDCode xsi:type="xsd:string">38209180305</IDCode>
			<Language xsi:type="xsd:string">EST</Language>
			<ServiceName xsi:type="xsd:string">SEB</ServiceName>
			<Role xsi:type="xsd:string">Klient/kliendi esindaja</Role>
			<SignersCountry xsi:type="xsd:string">EE</SignersCountry>
			<DataFiles>
				<DataFileDigest>
					<Id xsi:type="xsd:string">D0</Id>
					<DigestType xsi:type="xsd:string">SHA-1</DigestType>
					<DigestValue xsi:type="xsd:string">I7eEnm5t8Q78piwpm0Oa4MQYsek=
					</DigestValue>
				</DataFileDigest>
			</DataFiles>
			<Format xsi:type="xsd:string">DIGIDOC-XML</Format>
			<Version xsi:type="xsd:string">1.3</Version>
			<SignatureID xsi:type="xsd:string">S3504309</SignatureID>
			<MessageToDisplay xsi:type="xsd:string">Veendu, et kontrollkoodid
				on identsed</MessageToDisplay>
			<MessagingMode xsi:type="xsd:string">asynchClientServer
			</MessagingMode>
		</d:MobileCreateSignature>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>